In [3]:
%load_ext autoreload
%autoreload 2
import pandas as pd

#### AXIS: (axis='index' or axis=0) or (axis='columns or axis=1)

#### pandas - quickstart tutorial - https://pandas.pydata.org/pandas-docs/version/0.15.2/tutorials.html

In [4]:
df = pd.read_csv('teste.csv', delimiter = ',')

In [6]:
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [7]:
df.tail()

      animal  uniq_id  water_need
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

##### KAGGLE  - Indexing, selecting, assigning referenceÂ¶ - https://www.kaggle.com/residentmario/indexing-selecting-assigning

In [23]:
df.loc[3:5, 'animal'] # locating by index labes

3    tiger
4    tiger
5    tiger
Name: animal, dtype: object

In [24]:
df.loc[(df.animal =="lion") & (df.water_need > 430) ] #filter

   animal  uniq_id  water_need
16   lion     1017         600
17   lion     1018         500

In [32]:
df.set_index(['uniq_id','animal'])[0:3] #setting new indexes

                  water_need
uniq_id animal
1001    elephant         500
1002    elephant         600
1003    elephant         550

In [34]:
df.loc[df.water_need.notnull()][0:3]

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550

In [35]:
df['critic'] = 'everyone' #assigning new column and values

In [37]:
df[0:2]

     animal  uniq_id  water_need    critic
0  elephant     1001         500  everyone
1  elephant     1002         600  everyone

In [38]:
df.loc[df.animal.isin(['lion', 'elephant'])][0:5]

      animal  uniq_id  water_need    critic
0   elephant     1001         500  everyone
1   elephant     1002         600  everyone
2   elephant     1003         550  everyone
15      lion     1016         420  everyone
16      lion     1017         600  everyone

In [40]:
df.animal.notnull()[0:3]

0    True
1    True
2    True
Name: animal, dtype: bool

In [41]:
df.loc[df.animal.notnull()][:3]

     animal  uniq_id  water_need    critic
0  elephant     1001         500  everyone
1  elephant     1002         600  everyone
2  elephant     1003         550  everyone

##### KAGGLE  - Summary functions and maps workbook

In [10]:
df.animal.unique()

array(['elephant', 'tiger', 'zebra', 'lion', 'kangaroo'], dtype=object)

In [12]:
df.water_need.median()

325.0

In [42]:
df.animal.value_counts()  # !!!

zebra       7
tiger       5
lion        4
elephant    3
kangaroo    3
Name: animal, dtype: int64

In [44]:
centered_water_need = df.water_need - df.water_need.mean()

In [48]:
print(centered_water_need[0:4])

0    152.272727
1    252.272727
2    202.272727
3    -47.727273
Name: water_need, dtype: float64

In [51]:
bargain_idx = df.water_need.idxmax() # esse mÃ©todo traz o valor do indice do maior elemento 
bargain_wine = df.loc[bargain_idx, 'water_need']
print(bargain_idx, bargain_wine)

1 600

In [6]:
# precisa fazer cast primeiro para iterar com map - todo
a = df.water_need.astype(object) 
other = a.map(lambda desc: 4 in desc).sum()

lions = df.animal.map(lambda desc: "lion" in desc).sum()
zebras = df.animal.map(lambda desc: 'zebra' in desc).sum()
descriptor_counts = pd.Series([lions, zebras], index=['lions', 'zebras'])
print(descriptor_counts)

TypeError: argument of type 'int' is not iterable

In [76]:
df.water_need.astype(object)

0     500
1     600
2     550
3     300
4     320
5     330
6     290
7     310
8     200
9     220
10    240
11    230
12    220
13    100
14     80
15    420
16    600
17    500
18    390
19    410
20    430
21    410
Name: water_need, dtype: object